# Используем легкий официальный образ Python
FROM python:3.13-slim

# Устанавливаем uv (официальный и самый быстрый способ)
COPY --from=ghcr.io/astral-sh/uv:latest /uv /uvx /bin/

# Создаем папку для нашего приложения внутри контейнера
WORKDIR /app

# Копируем файлы конфигурации библиотек
COPY pyproject.toml uv.lock* ./

# Устанавливаем зависимости с помощью uv (без создания виртуального окружения, так как контейнер изолирован)
RUN uv sync --frozen --no-dev

# Копируем исходный код нашего проекта
COPY src/ src/

# Указываем порт, который будет слушать приложение
EXPOSE 8000

# Команда для запуска нашего FastAPI через uv
CMD ["uv", "run", "uvicorn", "src.api.main:app", "--host", "0.0.0.0", "--port", "8000"]